hamayun/NaSiK/sw/llvm/tools/tmsc6x-dis/tms320C6x_instruction.cpp

/* -*- c++ -*-
 *
 * SOCLIB_LGPL_HEADER_BEGIN
 *
 * This file is part of SoCLib, GNU LGPLv2.1.
 *
 * SoCLib is free software; you can redistribute it and/or modify it
 * under the terms of the GNU Lesser General Public License as published
 * by the Free Software Foundation; version 2.1 of the License.
 *
 * SoCLib is distributed in the hope that it will be useful, but
 * WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public
 * License along with SoCLib; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA
 * 02110-1301 USA
 *
 * SOCLIB_LGPL_HEADER_END
 *
 * TMS320C6X Instruction Set Simulator for the TMS320C6X processor core
 * developed for the SocLib Projet
 *
 * Copyright (C) IRISA/INRIA, 2008
 *         Francois Charot <charot@irisa.fr>
 *
 *
 * Maintainer: charot
 *
 * Functional description:
 * The following files:
 * 		tms320c62.h
 *              tms320c62.cpp
 *              tms320c62_instructions.cpp
 *              tms320c62_decoding.cpp
 *
 * define the Instruction Set Simulator for the TMS320C62 processor.
 *
 *
 */

/*
 * File:   tms320C6x_instruction.cpp
 * Author: hamayun 
 *
 * Created on August 3, 2010, 4:27 PM
 * Adapted from tms320c62_decoding.cpp
 */

#include "tms320C6x_instruction.h"
#include "block_packets.h"
#include <iostream>
#include <iomanip>

bool tms320C6x_instruction :: is_label()
{
    static coff_symbol_table    * psymtab = NULL;
    char                        * plabel = NULL;

    if(!psymtab)
    {
        psymtab = get_parent()->get_parent()->get_parent()->get_symbol_table();
        if(!psymtab)
        {
            DOUT << "Error: Getting Symbol Table Pointer" << endl;
            return false;
        }
    }

    plabel = psymtab->get_label(p_raw_instr->get_vir_addrs());
    if(plabel)
        return true;
    else
        return false;
}

int tms320C6x_instruction :: decode (raw_instr_t *ptr_instr)
{
    uint32_t instr = ptr_instr->get_value();
    p_raw_instr = ptr_instr; 

    m_creg  = (instr >> 29) & 0x07;
    m_z     = (instr >> 28) & 0x01;
    m_dst   = (instr >> 23) & 0x1f;
    m_src2  = (instr >> 18) & 0x1f;
    m_src1  = (instr >> 13) & 0x1f;
    m_x     = 0;
    m_s     = (instr >> 1) & 0x01;

    if(get_unit_op_x(instr)){
        DOUT << "Error: Decoding Instruction" << endl;
        return(-1);
    }

    //find constants
    m_sicst1 = ((int32_t) m_src1 << 27) >> 27; /*taking care of sign bit extn*/
    m_uicst1 = (uint32_t) m_src1;
    m_slcst1 = ((int64_t) m_src1 << 59) >> 59; /*taking care of sign bit extn*/
    m_ulcst1 = (uint64_t) m_src1;

    if((m_op == 0x00 || m_op == 0x01 || m_op == 0x02 || m_op == 0x03 ||
        m_op == 0x04 || m_op == 0x05 || m_op == 0x06 || m_op == 0x07) &&
        m_unit == DUNIT_LDSTBASEROFFSET)
    {
        m_y     = instr >> 7 & 0x1;
        m_mode  = instr >> 9 & 0xf;
    }
    else if((m_op == 0x01 || m_op == 0x02 || m_op == 0x03) &&
             m_unit == DUNIT_LDSTOFFSET)
    {
        m_y     = instr >> 7 & 0x1;
        m_uitmp = instr >> 8 & 0x7fff;
        m_uitmp = m_uitmp << 0;
    }
    else if((m_op == 0x00 || m_op == 0x04 || m_op == 0x05) &&
             m_unit == DUNIT_LDSTOFFSET)
    {
        m_y     = instr >> 7 & 0x1;
        m_uitmp = instr >> 8 & 0x7fff;
        m_uitmp = m_uitmp << 1;
    }
    else if((m_op == 0x06 || m_op == 0x07) &&
             m_unit == DUNIT_LDSTOFFSET)
    {
        m_y     = instr >> 7 & 0x1;
        m_uitmp = instr >> 8 & 0x7fff;  // The 15-Bit Unsigned Constant Offset
        //m_uitmp = m_uitmp << 2;       // In Reality this offset should be Shifted Left before Memory Access
    }

    if(m_op == 0x00 && m_unit == IDLEUNIT)
    {
        m_nop_cnt = ((instr >> 13) & 0x000f) + 1;
    }

    if(m_op == 0x00 && m_unit == SUNIT_ADDK)
    {
        m_addk_const = ((instr >> 7 & 0x0000ffff) << 16) >> 16;
    }

    if(m_unit == SUNIT_IMMED)
    {
        m_immed_const1 = ((instr >> 13) & 0x1f);
        m_immed_const2 = ((instr >> 8) & 0x1f);
    }

    if(m_unit == SUNIT_MVK)
    {
        m_mvk_type          = (instr >> 6 & 0x01);
        m_mvk_unsign_const  = (((instr >> 7) & 0x0000ffff) << 16);
        m_mvk_sign_const    = (((instr >> 7) & 0x0000ffff) << 16) >> 16;
    }

    if(m_unit == SUNIT_BCOND)
    {
        uint32_t    fetch_pkt_addr = get_parent()->get_parent()->get_fetch_pkt_address();

        m_bcond_disp        = (((instr >> 7) & 0x001fffff) << 11) >> 11;
        m_bcond_disp        = (m_bcond_disp << 2) + fetch_pkt_addr;
        m_bcond_disp        = m_bcond_disp & 0x7fffff;              // Discard bits higher than 23rd bit. 
    }
    
    return (0);
}

void tms320C6x_instruction :: print(ostream *out)
{
    out->setf(ios::basefield, ios::dec);
    print_creg(out);
    
    switch(m_unit)
    {
        case LUNIT:
            print_lunit(out);
            break;

        case MUNIT:
        /*case IDLEUNIT:*/
            if(m_op == 0x00 || m_op == 0x78)
                print_idle(out);
            else
                print_munit(out);
            break;

        case DUNIT:
            print_dunit(out); 
            break;

        case DUNIT_LDSTOFFSET:
            print_dunit_ldstoffset(out); 
            break;

        case DUNIT_LDSTBASEROFFSET:
            print_dunit_ldstbaseroffset(out); 
            break;

        case SUNIT:
            print_sunit(out); 
            break;

        case SUNIT_ADDK:
            print_sunit_addk(out);
            break;

        case SUNIT_IMMED:
            print_sunit_immed(out); 
            break;

        case SUNIT_MVK:
            print_sunit_mvk(out); 
            break;

        case SUNIT_BCOND:
            print_sunit_bcond(out);
            break;

        default:
            DOUT << "Error: Unknown Functional Unit Type" << endl;
            break;
    }
}

// Private Functions
// Decoding Helper Functions
int tms320C6x_instruction :: get_unit_op_x(uint32_t instr)
{
    if (getUnit_3bit(instr) == LUNIT)
    {
            // .L unit instruction
            m_x = (instr >> 12) & 0x01;
            m_op = (instr >> 5) & 0x7f;
            m_unit = LUNIT;
    }
    else if (getUnit_5bit(instr) == MUNIT)
    {
            // .M unit instruction
            m_x = (instr >> 12) & 0x01;
            m_op = (instr >> 7) & 0x1f;
            m_unit = MUNIT;
    }
    else if (getUnit_5bit(instr) == DUNIT)
    {
            // .D unit instruction
            m_op = (instr >> 7) & 0x3f;
            m_unit = DUNIT;
    }
    else if (getUnit_2bit(instr) == DUNIT_LDSTOFFSET)
    {
            // .D unit load/store
            m_op = (instr >> 4) & 0x07;
            m_unit = DUNIT_LDSTOFFSET;
    }
    else if (getUnit_2bit(instr) == DUNIT_LDSTBASEROFFSET)
    {
            // .D unit load/store with baseR/offsetR specified
            m_op = (instr >> 4) & 0x07;
            m_unit = DUNIT_LDSTBASEROFFSET;
    }
    else if (getUnit_4bit(instr) == SUNIT)
    {
            // .S unit instruction
            m_x = (instr >> 12) & 0x01;
            m_op = (instr >> 6) & 0x3f;
            m_unit = SUNIT;
    }
    else if (getUnit_5bit(instr) == SUNIT_ADDK)
    {
            // .S unit ADDK instruction
            m_op = 0; //nothing specified
            m_unit = SUNIT_ADDK;
    }
    else if (getUnit_4bit(instr) == SUNIT_IMMED)
    {
            // .S unit Field operations (immediate forms)
            m_op = (instr >> 6) & 0x03;
            m_unit = SUNIT_IMMED;
    }
    else if (getUnit_4bit(instr) == SUNIT_MVK)
    {
            // .S unit MVK
            m_op = 0; // nothing specified
            m_unit = SUNIT_MVK;
    }
    else if (getUnit_5bit(instr) == SUNIT_BCOND)
    {
            // .S unit Bcond disp
            m_op = 0; // nothing specified
            m_unit = SUNIT_BCOND;
    }
    else if (getUnit_11bit(instr) == NOP)
    {
            // NOP instruction
            m_op = 0;
            m_unit = 0;
    }
    else if (getUnit_16bit(instr) == IDLEINST)
    {
            m_op = IDLEOP;
            m_unit = IDLEUNIT;
    }
    else
    {
            /* unknown instruction kind */
            DOUT << "Error: Unknown Instruction Type" << endl;
            return(-1);
    }

    return(0); 
}

