hamayun/NaSiK/sw/llvm/tools/tmsc6x-dis/tms320C6x_instruction.cpp
// Print Helper Functions
void tms320C6x_instruction :: print_creg(ostream *out)
{

	if (m_creg == 0 && m_z == 0) {
		(*out) << "       ";
	} else {
		if (m_z == 1)
			(*out) << " [!";
		else
			(*out) << " [ ";
		if (m_creg == CREG_B0)
			(*out) << "B0] ";
		else if (m_creg == CREG_B1)
			(*out) << "B1] ";
		else if (m_creg == CREG_B2)
			(*out) << "B2] ";
		else if (m_creg == CREG_A1)
			(*out) << "A1] ";
		else if (m_creg == CREG_A2)
			(*out) << "A2] ";
	}
}

void tms320C6x_instruction :: print_lunit(ostream *out)
{
    switch(m_op)
    {
        case 0x1a :
            /*ABS xsint, sint*/
            iprint2(out, "ABS", m_src2, m_dst, "L", m_s, m_x, 2, OPTYPE_III);
            break;

        case 0x38 :
            /*ABS slong, slong*/
            iprint2(out, "ABS", m_src2, m_dst, "L", m_s, m_x, 0, OPTYPE_ILL);
            break;

        case 0x03 :
            /*ADD sint, xsint, sint*/
            iprint(out, "ADD", m_src1, m_src2, m_dst, "L", m_s, m_x, 2, OPTYPE_III);
            break;

        case 0x23 :
            /*ADD sint, xsint, slong*/
            iprint(out, "ADD", m_src1, m_src2, m_dst, "L", m_s, m_x, 2, OPTYPE_IIL);
            break;

        case 0x2b :
            /*ADDU usint, xusint, uslong*/
            iprint(out, "ADDU", m_src1, m_src2, m_dst, "L", m_s, m_x, 2, OPTYPE_IIL);
            break;

        case 0x21 :
            /*ADD xsint, slong, slong*/
            iprint(out, "ADD", m_src1, m_src2, m_dst, "L", m_s, m_x, 1, OPTYPE_ILL);
            break;

        case 0x29 :
            /*ADDU xusint, uslong, uslong*/
            iprint(out, "ADDU", m_src1, m_src2, m_dst, "L", m_s, m_x, 1, OPTYPE_ILL);
            break;

        case 0x02 :
            /*ADD scst5, xsint, sint*/
            iprintc1(out, "ADD", m_sicst1, m_src2, m_dst, "L", m_s, m_x, 2, OPTYPE_III);
            break;

        case 0x20 :
            /*ADD scst5, slong, slong*/
            iprintc1(out, "ADD", m_sicst1, m_src2, m_dst, "L", m_s, m_x, 0, OPTYPE_ILL);
            break;

        case 0x7b :
            /*AND usint, xusint, usint*/
            iprint(out, "AND", m_src1, m_src2, m_dst, "L", m_s, m_x, 2, OPTYPE_III);
            break;

        case 0x7a :
            /*AND scst5, xusint, usint*/
            iprintc1(out, "AND", m_sicst1, m_src2, m_dst, "L", m_s, m_x, 2, OPTYPE_III);
            break;

        case 0x53 :
            /*CMPEQ sint, xsint, usint*/
            iprint(out, "CMPEQ", m_src1, m_src2, m_dst, "L", m_s, m_x, 2, OPTYPE_III);
            break;

        case 0x52 :
            /*CMPEQ scst5, xsint, usint*/
            iprintc1(out, "CMPEQ", m_sicst1, m_src2, m_dst, "L", m_s, m_x, 2, OPTYPE_III);
            break;

        case 0x51 :
            /*CMPEQ xsint, slong, usint*/
            iprint(out, "CMPEQ", m_src1, m_src2, m_dst, "L", m_s, m_x, 1, OPTYPE_ILI);
            break;

        case 0x50 :
            /*CMPEQ scst5, slong, usint*/
            iprintc1(out, "CMPEQ", m_sicst1, m_src2, m_dst, "L", m_s, m_x, 0, OPTYPE_ILI);
            break;

        case 0x47 :
            /*CMPGT sint, xsint, usint*/
            iprint(out, "CMPGT", m_src1, m_src2, m_dst, "L", m_s, m_x, 2, OPTYPE_III);
            break;

        case 0x46 :
            /*CMPGT scst5, xsint, usint*/
            iprintc1(out, "CMPGT", m_sicst1, m_src2, m_dst, "L", m_s, m_x, 2, OPTYPE_III);
            break;

        case 0x45 :
            /*CMPGT xsint, slong, usint*/
            iprint(out, "CMPGT", m_src1, m_src2, m_dst, "L", m_s, m_x, 1, OPTYPE_ILI);
            break;

        case 0x44 :
            /*CMPGT scst5, slong, usint*/
            iprintc1(out, "CMPGT", m_sicst1, m_src2, m_dst, "L", m_s, m_x, 0, OPTYPE_ILI);
            break;

        case 0x4f :
            /*CMPGTU usint, xusint, usint*/
            iprint(out, "CMPGTU", m_src1, m_src2, m_dst, "L", m_s, m_x, 2, OPTYPE_III);
            break;

        case 0x4e :
            /*CMPGTU ucst5, xusint, usint*/
            iprintc1(out, "CMPGTU", m_uicst1, m_src2, m_dst, "L", m_s, m_x, 2, OPTYPE_III);
            break;

        case 0x4d :
            /*CMPGTU xusint, uslong, usint*/
            iprint(out, "CMPGTU", m_src1, m_src2, m_dst, "L", m_s, m_x, 1, OPTYPE_ILI);
            break;

        case 0x4c :
            /*CMPGTU ucst5, uslong, usint*/
            iprintc1(out, "CMPGTU", m_uicst1, m_src2, m_dst, "L", m_s, m_x, 0, OPTYPE_ILI);
            break;

        case 0x57 :
            /*CMPLT sint, xsint, usint*/
            iprint(out, "CMPLT", m_src1, m_src2, m_dst, "L", m_s, m_x, 2, OPTYPE_III);
            break;

        case 0x56 :
            /*CMPLT scst5, xsint, usint*/
            iprintc1(out, "CMPLT", m_sicst1, m_src2, m_dst, "L", m_s, m_x, 2, OPTYPE_III);
            break;

        case 0x55 :
            /*CMPLT xsint, slong, usint*/
            iprint(out, "CMPLT", m_src1, m_src2, m_dst, "L", m_s, m_x, 1, OPTYPE_ILI);
            break;

        case 0x54 :
            /*CMPLT scst5, slong, usint*/
            iprintc1(out, "CMPLT", m_sicst1, m_src2, m_dst, "L", m_s, m_x, 0, OPTYPE_ILI);
            break;

        case 0x5f :
            /*CMPLTU usint, xusint, usint*/
            iprint(out, "CMPLTU", m_src1, m_src2, m_dst, "L", m_s, m_x, 2, OPTYPE_III);
            break;

        case 0x5e :
            /*CMPLTU ucst5, xusint, usint*/
            iprintc1(out, "CMPLTU", m_uicst1, m_src2, m_dst, "L", m_s, m_x, 2, OPTYPE_III);
            break;

        case 0x5d :
            /*CMPLTU xusint, uslong, usint*/
            iprint(out, "CMPLTU", m_src1, m_src2, m_dst, "L", m_s, m_x, 1, OPTYPE_ILI);
            break;

        case 0x5c :
            /*CMPLTU ucst5, uslong, usint*/
            iprintc1(out, "CMPLTU", m_uicst1, m_src2, m_dst, "L", m_s, m_x, 0, OPTYPE_ILI);
            break;

        case 0x6b :
            /*LMBD - Left Most Bit Detection usint, xusint, usint*/
            iprint(out, "LMBD", m_src1, m_src2, m_dst, "L", m_s, m_x, 2, OPTYPE_III);
            break;

        case 0x6a :
            /*LMBD - Left Most Bit Detection ucst5, xusint, usint*/
            iprintc1(out, "LMBD", m_uicst1, m_src2, m_dst, "L", m_s, m_x, 2, OPTYPE_III);
            break;

        case 0x63 :
            /*NORM Normalize Integer, # of redundant sign bits are found xsint, usint*/
            iprint2(out, "NORM", m_src2, m_dst, "L", m_s, m_x, 2, OPTYPE_III);
            break;

        case 0x60 :
            /*NORM Normalize Integer, # of redundant sign bits are found slong, usint*/
            iprint2(out, "NORM", m_src2, m_dst, "L", m_s, m_x, 0, OPTYPE_ILI);
            break;

        case 0x7f :
            /*Bitwise OR usint, xusint, usint*/
            iprint(out, "OR", m_src1, m_src2, m_dst, "L", m_s, m_x, 2, OPTYPE_III);
            break;

