hamayun/NaSiK/sw/llvm/tools/tmsc6x-dis/tms320C6x_instruction.cpp
        case 0x7e :
            /*Bitwise OR scst5, xusint, usint*/
            iprintc1(out, "OR", m_sicst1, m_src2, m_dst, "L", m_s, m_x, 2, OPTYPE_III);
            break;

        case 0x13 :
            /*SADD Integer addition with saturation to result size sint, xsint, sint*/
            iprint(out, "SADD", m_src1, m_src2, m_dst, "L", m_s, m_x, 2, OPTYPE_III);
            break;

        case 0x31 :
            /*SADD Integer addition with saturation to result size xsint, slong, slong*/
            iprint(out, "SADD", m_src1, m_src2, m_dst, "L", m_s, m_x, 1, OPTYPE_ILL);
            break;

        case 0x12 :
            /*SADD Integer addition with saturation to result size scst5, xsint, sint*/
            iprintc1(out, "SADD", m_sicst1, m_src2, m_dst, "L", m_s, m_x, 2, OPTYPE_III);
            break;

        case 0x30 :
            /*SADD Integer addition with saturation to result size scst5, slong, slong*/
            iprintc1(out, "SADD", m_sicst1, m_src2, m_dst, "L", m_s, m_x, 0, OPTYPE_ILL);
            break;

        case 0x40 :
            if(m_src1 == 0x00){
                /*SAT saturate a 40bit integer to a 32bit integer slong, sint*/
                iprint2(out, "SAT", m_src2, m_dst, "L", m_s, m_x, 0, OPTYPE_ILI);
            }
            else
            {
                DOUT << "Error: Invalid Instruction. src1 = 0x" << hex << m_src1 << endl;
            }
            break;

        case 0x0f :
            /*SSUB Integer addition with saturation to result size sint, xsint, sint*/
            iprint(out, "SSUB", m_src1, m_src2, m_dst, "L", m_s, m_x, 2, OPTYPE_III);
            break;

        case 0x1f :
            /*SSUB Integer addition with saturation to result size xsint, sint, sint*/
            iprint(out, "SSUB", m_src1, m_src2, m_dst, "L", m_s, m_x, 1, OPTYPE_III);
            break;

        case 0x0e :
            /*SSUB Integer addition with saturation to result size scst5, xsint, sint*/
            iprintc1(out, "SSUB", m_sicst1, m_src2, m_dst, "L", m_s, m_x, 2, OPTYPE_III);
            break;

        case 0x2c :
            /*SSUB Integer addition with saturation to result size scst5, slong, slong*/
            iprintc1(out, "SSUB", m_sicst1, m_src2, m_dst, "L", m_s, m_x, 0, OPTYPE_ILL);
            break;

        case 0x07 :
            /*SUB without saturation sint, xsint, sint*/
            iprint(out, "SUB", m_src1, m_src2, m_dst, "L", m_s, m_x, 2, OPTYPE_III);
            break;

        case 0x17 :
            /*SUB without saturation xsint, sint, sint*/
            iprint(out, "SUB", m_src1, m_src2, m_dst, "L", m_s, m_x, 1, OPTYPE_III);
            break;

        case 0x27 :
            /*SUB without saturation sint, xsint, slong*/
            iprint(out, "SUB", m_src1, m_src2, m_dst, "L", m_s, m_x, 2, OPTYPE_IIL);
            break;

        case 0x37 :
            /*SUB without saturation xsint, sint, slong*/
            iprint(out, "SUB", m_src1, m_src2, m_dst, "L", m_s, m_x, 1, OPTYPE_IIL);
            break;

        case 0x2f :
            /*SUBU without saturation usint, xusint, uslong*/
            iprint(out, "SUBU", m_src1, m_src2, m_dst, "L", m_s, m_x, 2, OPTYPE_IIL);
            break;

        case 0x3f :
            /*SUBU without saturation xusint, usint, uslong*/
            iprint(out, "SUBU", m_src1, m_src2, m_dst, "L", m_s, m_x, 1, OPTYPE_IIL);
            break;

        case 0x06 :
            /*SUB without saturation scst5, xsint, sint*/
            iprintc1(out, "SUB", m_sicst1, m_src2, m_dst, "L", m_s, m_x, 2, OPTYPE_III);
            break;

        case 0x24 :
            /*SUB without saturation scst5, slong, slong*/
            iprintc1(out, "SUB", m_sicst1, m_src2, m_dst, "L", m_s, m_x, 2, OPTYPE_ILL);
            break;

        case 0x4b :
            /*SUBC Conditional Integer Subtract and Shift - used for division usint, xusint, usint*/
            iprint(out, "SUBC", m_src1, m_src2, m_dst, "L", m_s, m_x, 2, OPTYPE_III);
            break;

        case 0x6f :
            /*XOR usint, xusint, usint*/
            iprint(out, "XOR", m_src1, m_src2, m_dst, "L", m_s, m_x, 2, OPTYPE_III);
            break;

        case 0x6e :
            /*XOR scst5, xusint, usint*/
            iprintc1(out, "XOR", m_sicst1, m_src2, m_dst, "L", m_s, m_x, 2, OPTYPE_III);
            break;

        default:
            DOUT << "Error: Unknown Instruction for LUNIT" << endl;
            break;
    }
}

void tms320C6x_instruction :: print_sunit(ostream *out)
{
    switch(m_op)
    {
 	case 0x07 :
            /*ADD sint, xsint, sint*/
            iprint(out, "ADD", m_src1, m_src2, m_dst, "S", m_s, m_x, 2, OPTYPE_III);
            break;

	case 0x06 :
            /*ADD scst5, xsint, sint*/
            iprintc1(out, "ADD", m_sicst1, m_src2, m_dst, "S", m_s, m_x, 2, OPTYPE_III);
            break;

	case 0x01 :
            /*ADD2 sint, xsint, sint*/
            iprint(out, "ADD2", m_src1, m_src2, m_dst, "S", m_s, m_x, 2, OPTYPE_III);
            break;

	case 0x1f :
            /*AND usint, xusint, usint*/
            iprint(out, "AND", m_src1, m_src2, m_dst, "S", m_s, m_x, 2, OPTYPE_III);
            break;

	case 0x1e :
            /*AND scst5, xusint, usint*/
            iprintc1(out, "AND", m_sicst1, m_src2, m_dst, "S", m_s, m_x, 2, OPTYPE_III);
            break;

	case 0x0d :
            /*Branch using a Register, xusint*/
            iprint_breg(out, "B", m_src2, "S", m_s, m_x, 2);
            break;

        case 0x03 :
            if(m_src2 == 0x06){
                /*Branch Using an IRP - Interrupt Return Pointer*/
                iprint0(out, "B IRP ");
            }
            else if(m_src2 == 0x07){
                /*Branch using NMI Return Pointer & set NMIE in crf[IER]*/
                iprint0(out, "B NRP ");
            }
            else{
                DOUT << "Error: Unknown Instruction" << endl; 
            }
            break;
                
	case 0x3f :
            /*CLR Clear Bit Fields of m_src2 whose bounds are given by 5-9 & 0-4 of m_src1*/
            /*usint, xusint, usint*/
            iprint(out, "CLR", m_src1, m_src2, m_dst, "S", m_s, m_x, 2, OPTYPE_III);
            break;
            
	case 0x2f :
            /*EXT Extract & Sign Extend a bit field*/
            /*usint, xsint, sint*/
            iprint(out, "EXT", m_src1, m_src2, m_dst, "S", m_s, m_x, 2, OPTYPE_III);
            break;
            
	case 0x2b :
            /*EXTU Extract & Zero Extend a bit field*/
            /*usint, xusint, usint*/
            iprint(out, "EXTU", m_src1, m_src2, m_dst, "S", m_s, m_x, 2, OPTYPE_III);
            break;
            
