hamayun/NaSiK/sw/llvm/tools/tmsc6x-dis/tms320C6x_instruction.cpp
	case 0x0f :
            /*MVC Move between Control File & Register File usint, usint*/
            // Control File --> Register File
            iprint2mvc(out, "MVC", m_src2, m_dst, "S", m_s, m_x, 0);
            break;

	case 0x0e :
            /*MVC Move between Control File & Register File xusint, usint*/
            // Register File --> Control File
            iprint2mvc(out, "MVC", m_src2, m_dst, "S", m_s, m_x, 2);
            break;

	case 0x1b :
            /*Bitwise OR usint, xusint, usint*/
            iprint(out, "OR", m_src1, m_src2, m_dst, "S", m_s, m_x, 2, OPTYPE_III);
            break;
            
	case 0x1a :
            /*Bitwise OR scst5, xusint, usint*/
            iprintc1(out, "OR", m_sicst1, m_src2, m_dst, "S", m_s, m_x, 2, OPTYPE_III);
            break;
            
        case 0x3b :
            /*SET Set Bit Fields of m_src2 whose bounds are given by 5-9 & 0-4 of m_src1*/
            /*usint, xusint, usint*/
            iprint(out, "SET", m_src1, m_src2, m_dst, "L", m_s, m_x, 2, OPTYPE_III);
            break;

	case 0x33 :
            /*SHL Shift Left by amount given in m_src1 usint, xsint, sint*/
            iprint_shift(out, "SHL", m_src1, m_src2, m_dst, "S", m_s, m_x, 2, OPTYPE_III);
            break;

	case 0x31 :
            /*SHL Shift Left by amount given in m_src1 usint, slong, slong*/
            iprint_shift(out, "SHL", m_src1, m_src2, m_dst, "S", m_s, m_x, 0, OPTYPE_ILL);
            break;

	case 0x13 :
            /*SHL Shift Left by amount given in m_src1 usint, xusint, uslong*/
            iprint_shift(out, "SHL", m_src1, m_src2, m_dst, "S", m_s, m_x, 2, OPTYPE_IIL);
            break;

	case 0x32 :
            /*SHL Shift Left by amount given in m_src1 ucst5, xsint, sint*/
            iprintc1_shift(out, "SHL", m_uicst1, m_src2, m_dst, "S", m_s, m_x, 2, OPTYPE_III);
            break;

	case 0x30 :
            /*SHL Shift Left by amount given in m_src1 ucst5, slong, slong*/
            iprintc1_shift(out, "SHL", m_uicst1, m_src2, m_dst, "S", m_s, m_x, 0, OPTYPE_ILL);
            break;

	case 0x12 :
            /*SHL Shift Left by amount given in m_src1 ucst5, xusint, uslong*/
            iprintc1_shift(out, "SHL", m_uicst1, m_src2, m_dst, "S", m_s, m_x, 2, OPTYPE_IIL);
            break;

	case 0x37 :
            /*SHR Shift Right  by amount given in m_src1 usint, xsint, sint*/
            iprint_shift(out, "SHR", m_src1, m_src2, m_dst, "S", m_s, m_x, 2, OPTYPE_III);
            break;

	case 0x35 :
            /*SHR Shift Right by amount given in m_src1 usint, slong, slong*/
            iprint_shift(out, "SHR", m_src1, m_src2, m_dst, "S", m_s, m_x, 0, OPTYPE_ILL);
            break;

	case 0x36 :
            /*SHR Shift Right by amount given in m_src1 ucst5, xsint, sint*/
            iprintc1_shift(out, "SHR", m_uicst1, m_src2, m_dst, "S", m_s, m_x, 2, OPTYPE_III);
            break;

	case 0x34 :
            /*SHR Shift Right by amount given in m_src1 ucst5, slong, slong*/
            iprintc1_shift(out, "SHR", m_uicst1, m_src2, m_dst, "S", m_s, m_x, 0, OPTYPE_ILL);
            break;

	case 0x27 :
            /*SHRU Logical Shift Right by amount given in m_src1 usint, xusint, usint*/
            iprint_shift(out, "SHRU", m_src1, m_src2, m_dst, "S", m_s, m_x, 2, OPTYPE_III);
            break;

	case 0x25 :
            /*SHRU Logical Shift Right by amount given in m_src1 usint, uslong, uslong*/
            iprint_shift(out, "SHRU", m_src1, m_src2, m_dst, "S", m_s, m_x, 0, OPTYPE_ILL);
            break;

	case 0x26 :
            /*SHRU Logical Shift Right by amount given in m_src1 ucst5, xusint, usint*/
            iprintc1_shift(out, "SHRU", m_uicst1, m_src2, m_dst, "S", m_s, m_x, 2, OPTYPE_III);
            break;

	case 0x24 :
            /*SHRU Logical Shift Right by amount given in m_src1 ucst5, uslong, uslong*/
            iprintc1_shift(out, "SHRU", m_uicst1, m_src2, m_dst, "S", m_s, m_x, 0, OPTYPE_ILL);
            break;

	case 0x23 :
            /*SSHL Shift Left with Saturation usint, xsint, sint*/
            iprint(out, "SSHL", m_src1, m_src2, m_dst, "S", m_s, m_x, 2, OPTYPE_III);
            break;

	case 0x22 :
            /*SSHL Shift Left with Saturation ucst5, xsint, sint*/
            iprintc1(out, "SSHL", m_uicst1, m_src2, m_dst, "S", m_s, m_x, 2, OPTYPE_III);
            break;

	case 0x17 :
            /*SUB without saturation sint, xsint, sint*/
            iprint(out, "SUB", m_src1, m_src2, m_dst, "S", m_s, m_x, 2, OPTYPE_III);
            break;

	case 0x16 :
            /*SUB without saturation scst5, xsint, sint*/
            iprintc1(out, "SUB", m_sicst1, m_src2, m_dst, "S", m_s, m_x, 2, OPTYPE_III);
            break;

	case 0x11 :
            /*SUB2 Subtractions of lower and upper halfs sint, xsint, sint*/
            iprint(out, "SUB2", m_src1, m_src2, m_dst, "S", m_s, m_x, 2, OPTYPE_III);
            break;

	case 0x0b :
            /*XOR usint, xusint, usint*/
            iprint(out, "XOR", m_src1, m_src2, m_dst, "S", m_s, m_x, 2, OPTYPE_III);
            break;

	case 0x0a :
            /*XOR scst5, xusint, usint*/
            iprintc1(out, "XOR", m_sicst1, m_src2, m_dst, "S", m_s, m_x, 2, OPTYPE_III);
            break;
            
        default:
            DOUT << "Error: Unknown Instruction for SUNIT" << endl;
            break;
    }
}

void tms320C6x_instruction :: print_munit(ostream *out)
{
    switch(m_op)
    {
	case 0x19 :
            /*MPY Integer Multiply 16lsb x 16lsb; slsb16, xslsb16, sint*/
            iprint(out, "MPY", m_src1, m_src2, m_dst, "M", m_s, m_x, 2, OPTYPE_III);
            break;

	case 0x1f :
            /*MPYU Integer Multiply 16lsb x 16lsb; ulsb16, xulsb16, usint*/
            iprint(out, "MPYU", m_src1, m_src2, m_dst, "M", m_s, m_x, 2, OPTYPE_III);
            break;

	case 0x1d :
            /*MPYUS Integer Multiply 16lsb x 16lsb; ulsb16, xslsb16, sint*/
            iprint(out, "MPYUS", m_src1, m_src2, m_dst, "M", m_s, m_x, 2, OPTYPE_III);
            break;

	case 0x1b :
            /*MPYSU Integer Multiply 16lsb x 16lsb; slsb16, xulsb16, sint*/
            iprint(out, "MPYSU", m_src1, m_src2, m_dst, "M", m_s, m_x, 2, OPTYPE_III);
            break;

	case 0x18 :
            /*MPY Integer Multiply 16lsb x 16lsb; scst5, xslsb16, sint*/
            iprintc1(out, "MPY", m_sicst1, m_src2, m_dst, "M", m_s, m_x, 2, OPTYPE_III);
            break;

