hamayun/NaSiK/sw/llvm/tools/tmsc6x-dis/tms320C6x_instruction.cpp
	case 0x1e :
            /*MPYSU Integer Multiply 16lsb x 16lsb; scst5, xulsb16, sint*/
            iprintc1(out, "MPYSU", m_sicst1, m_src2, m_dst, "M", m_s, m_x, 2, OPTYPE_III);
            break;

	case 0x01 :
            /*MPYH Integer Multiply 16msb x 16msb; smsb16, xsmsb16, sint*/
            iprint(out, "MPYH", m_src1, m_src2, m_dst, "M", m_s, m_x, 2, OPTYPE_III);
            break;

	case 0x07 :
            /*MPYHU Integer Multiply 16msb x 16msb; umsb16, xumsb16, usint*/
            iprint(out, "MPYHU", m_src1, m_src2, m_dst, "M", m_s, m_x, 2, OPTYPE_III);
            break;

	case 0x05 :
            /*MPYHUS Integer Multiply 16msb x 16msb; umsb16, xsmsb16, sint*/
            iprint(out, "MPYHUS", m_src1, m_src2, m_dst, "M", m_s, m_x, 2, OPTYPE_III);
            break;

	case 0x03 :
            /*MPYHSU Integer Multiply 16msb x 16msb; smsb16, xumsb16, sint*/
            iprint(out, "MPYHSU", m_src1, m_src2, m_dst, "M", m_s, m_x, 2, OPTYPE_III);
            break;

	case 0x09 :
            /*MPYHL Integer Multiply 16msb x 16lsb; smsb16, xslsb16, sint*/
            iprint(out, "MPYHL", m_src1, m_src2, m_dst, "M", m_s, m_x, 2, OPTYPE_III);
            break;

	case 0x0f :
            /*MPYHLU Integer Multiply 16msb x 16lsb; umsb16, xulsb16, usint*/
            iprint(out, "MPYHLU", m_src1, m_src2, m_dst, "M", m_s, m_x, 2, OPTYPE_III);
            break;

	case 0x0d :
            /*MPYHULS Integer Multiply 16msb x 16lsb; umsb16, xslsb16, sint*/
            iprint(out, "MPYHULS", m_src1, m_src2, m_dst, "M", m_s, m_x, 2, OPTYPE_III);
            break;

	case 0x0b :
            /*MPYHSLU Integer Multiply 16msb x 16lsb; smsb16, xulsb16, sint*/
            iprint(out, "MPYHSLU", m_src1, m_src2, m_dst, "M", m_s, m_x, 2, OPTYPE_III);
            break;

	case 0x11 :
            /*MPYLH Integer Multiply 16lsb x 16msb; slsb16, xsmsb16, sint*/
            iprint(out, "MPYLH", m_src1, m_src2, m_dst, "M", m_s, m_x, 2, OPTYPE_III);
            break;

	case 0x17 :
            /*MPYLHU Integer Multiply 16lsb x 16msb; ulsb16, xumsb16, usint*/
            iprint(out, "MPYLHU", m_src1, m_src2, m_dst, "M", m_s, m_x, 2, OPTYPE_III);
            break;

	case 0x15 :
            /*MPYLUHS Integer Multiply 16lsb x 16msb ulsb16, xsmsb16, sint*/
            iprint(out, "MPYLUHS", m_src1, m_src2, m_dst, "M", m_s, m_x, 2, OPTYPE_III);
            break;

#if 0
        //TODO: How to differentiate this following case from similar one above?
	case 0x11 :
            /*MPYLSHU Integer Multiply 16lsb x 16msb slsb16, xumsb16, sint*/
            iprint(out, "MPYLSHU {slsb16, xumsb16, sint}", m_src1, m_src2, m_dst, "M", m_s, m_x, 2);
            break;
#endif
        case 0x1a :
            /*SMPY slsb16, xslsb16, sint*/
            iprint(out, "SMPY", m_src1, m_src2, m_dst, "M", m_s, m_x, 2, OPTYPE_III);
            break;

	case 0x0a :
            /*SMPYHL smsb16, xslsb16, sint*/
            iprint(out, "SMPYHL", m_src1, m_src2, m_dst, "M", m_s, m_x, 2, OPTYPE_III);
            break;

	case 0x12 :
            /*SMPYLH slsb16, xsmsb16, sint*/
            iprint(out, "SMPYLH", m_src1, m_src2, m_dst, "M", m_s, m_x, 2, OPTYPE_III);
            break;

	case 0x02 :
            /*SMPYH smsb16, xsmsb16, sint*/
            iprint(out, "SMPYH", m_src1, m_src2, m_dst, "M", m_s, m_x, 2, OPTYPE_III);
            break;

        default:
            DOUT << "Error: Unknown Instruction for MUNIT" << endl;
            break;
    }
}

void tms320C6x_instruction :: print_dunit(ostream *out)
{
    switch(m_op)
    {
	case 0x10 :
            /* ADD sint, sint, sint*/
            iprint_rev(out, "ADD", m_src1, m_src2, m_dst, "D", m_s, m_x);
            break;

	case 0x12 :
            /* ADD ucst5, sint, sint*/
            iprint_revc(out, "ADD", m_uicst1, m_src2, m_dst, "D", m_s, m_x);
            break;

	case 0x30 :
            /*ADDAB Add Byte with Addressing sint, sint, sint;  {+baseR[offsetR], dst}*/
            iprint_rev(out, "ADDAB", m_src1, m_src2, m_dst, "D", m_s, m_x);
            break;

	case 0x34 :
            /*ADDAH Add Byte with Addressing sint, sint, sint; {+baseR[offsetR], dst}*/
            iprint_rev(out, "ADDAH", m_src1, m_src2, m_dst, "D", m_s, m_x);
            break;

	case 0x38 :
            /*ADDAW Add Byte with Addressing sint, sint, sint; {+baseR[offsetR], dst}*/
            iprint_rev(out, "ADDAW", m_src1, m_src2, m_dst, "D", m_s, m_x);
            break;

	case 0x32 :
            /*ADDAB Add Byte with Addressing ucsut5, sint, sint; {+baseR[offset], dst}*/
            iprint_revc(out, "ADDAB", m_src1, m_src2, m_dst, "D", m_s, m_x);
            break;

	case 0x36 :
            /*ADDAH Add Byte with Addressing ucsut5, sint, sint; {+baseR[offset], dst}*/
            iprint_revc(out, "ADDAH", m_src1, m_src2, m_dst, "D", m_s, m_x);
            break;

	case 0x3a :
            /*ADDAW Add Byte with Addressing ucsut5, sint, sint; {+baseR[offset], dst}*/
            iprint_revc(out, "ADDAW", m_src1, m_src2, m_dst, "D", m_s, m_x);
            break;

	case 0x11 :
            /*SUB without saturation sint, sint, sint*/
            iprint_rev(out, "SUB", m_src1, m_src2, m_dst, "D", m_s, m_x);
            break;

	case 0x13 :
            /*SUB without saturation ucst5, sint, sint*/
            iprint_revc(out, "SUB", m_uicst1, m_src2, m_dst, "D", m_s, m_x);
            break;

	case 0x31 :
            /*SUBAB Add Byte with Addressing sint, sint, sint; {+baseR[offsetR], dst}*/
            iprint_rev(out, "SUBAB", m_src1, m_src2, m_dst, "D", m_s, m_x);
            break;

	case 0x35 :
            /*SUBAH Add Byte with Addressing sint, sint, sint; {+baseR[offsetR], dst}*/
            iprint_rev(out, "SUBAH", m_src1, m_src2, m_dst, "D", m_s, m_x);
            break;

	case 0x39 :
            /*SUBAW Add Byte with Addressing sint, sint, sint; {+baseR[offsetR], dst}*/
            iprint_rev(out, "SUBAW", m_src1, m_src2, m_dst, "D", m_s, m_x);
            break;

	case 0x33 :
            /*SUBAB Add Byte with Addressing ucsut5, sint, sint; {+baseR[offset], dst}*/
            iprint_revc(out, "SUBAB", m_src1, m_src2, m_dst, "D", m_s, m_x);
            break;

	case 0x37 :
            /*SUBAH Add Byte with Addressing ucsut5, sint, sint; {+baseR[offset], dst}*/
            iprint_revc(out, "SUBAH", m_src1, m_src2, m_dst, "D", m_s, m_x);
            break;

	case 0x3b :
            /*SUBAW Add Byte with Addressing ucsut5, sint, sint; {+baseR[offset], dst}*/
            iprint_revc(out, "SUBAW", m_src1, m_src2, m_dst, "D", m_s, m_x);
            break;

        default:
            DOUT << "Error: Unknown Instruction Type" << endl;
            break;
    }
}

