hamayun/NaSiK/sw/llvm/tools/tmsc6x-dis/tms320C6x_instruction.cpp
void tms320C6x_instruction :: print_dunit_ldstbaseroffset(ostream *out)
{
    switch(m_op){
	case 0x02 :
            /*LDB Load Byte*/
            switch (m_mode) {
            case 0x5:
                    /* {+baseR[offsetR], dst} */
                    iprintld(out, "LDB", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0x4:
                    /* {-baseR[offsetR], dst} */
                    iprintld(out, "LDB", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xd:
                    /* {++baseR[offsetR], dst} */
                    iprintld(out, "LDB", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xc:
                    /* {--baseR[offsetR], dst} */
                    iprintld(out, "LDB", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xf:
                    /* {baseR++[offsetR], dst} */
                    iprintld(out, "LDB", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xe:
                    /* {baseR--[offsetR], dst} */
                    iprintld(out, "LDB", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0x1:
                    /* {+baseR[offset], dst} */
                    iprintldc(out, "LDB", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0x0:
                    /* {-baseR[offset], dst} */
                    iprintldc(out, "LDB", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0x9:
                    /* {++baseR[offset], dst} */
                    iprintldc(out, "LDB", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0x8:
                    /* {--baseR[offset], dst} */
                    iprintldc(out, "LDB", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xb:
                    /* {baseR++[offset], dst} */
                    iprintldc(out, "LDB", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xa:
                    /* {baseR--[offset], dst} */
                    iprintldc(out, "LDB", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            default:
                    iprintld(out, "LDB **unknown mode**", 0, 0, 0, "D", 0, 0);
                    break;
            }
            break;

	case 0x01 :
            /*LDBU Load Byte*/
            switch (m_mode) {
            case 0x5:
                    iprintld(out, "LDBU", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0x4:
                    iprintld(out, "LDBU", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xd:
                    iprintld(out, "LDBU", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xc:
                    iprintld(out, "LDBU", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xf:
                    iprintld(out, "LDBU", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xe:
                    iprintld(out, "LDBU", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0x1:
                    iprintldc(out, "LDBU", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0x0:
                    iprintldc(out, "LDBU", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0x9:
                    iprintldc(out, "LDBU", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0x8:
                    iprintldc(out, "LDBU", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xb:
                    iprintldc(out, "LDBU", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xa:
                    iprintldc(out, "LDBU", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            default:
                    iprintld(out, "LDBU **unknown mode**", 0, 0, 0, "D", 0, 0);
                    break;

            }
            break;

	case 0x04 :
            /*LDH Load Byte*/
            switch (m_mode) {
            case 0x5:
                    iprintld(out, "LDH", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0x4:
                    iprintld(out, "LDH", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xd:
                    iprintld(out, "LDH", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xc:
                    iprintld(out, "LDH", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xf:
                    iprintld(out, "LDH", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xe:
                    iprintld(out, "LDH", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0x1:
                    iprintldc(out, "LDH", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0x0:
                    iprintldc(out, "LDH", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0x9:
                    iprintldc(out, "LDH", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0x8:
                    iprintldc(out, "LDH", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xb:
                    iprintldc(out, "LDH", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xa:
                    iprintldc(out, "LDH", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            default:
                    iprintld(out, "LDH **unknown mode**", 0, 0, 0, "D", 0, 0);
                    break;

