hamayun/NaSiK/sw/llvm/tools/tmsc6x-dis/tms320C6x_instruction.cpp
            }
            break;

	case 0x00 :
            /*LDHU Load Byte*/
            switch (m_mode) {
            case 0x5:
                    iprintld(out, "LDHU", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0x4:
                    iprintld(out, "LDHU", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xd:
                    iprintld(out, "LDHU", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xc:
                    iprintld(out, "LDHU", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xf:
                    iprintld(out, "LDHU", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xe:
                    iprintld(out, "LDHU", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0x1:
                    iprintldc(out, "LDHU", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0x0:
                    iprintldc(out, "LDHU", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0x9:
                    iprintldc(out, "LDHU", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0x8:
                    iprintldc(out, "LDHU", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xb:
                    iprintldc(out, "LDHU", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xa:
                    iprintldc(out, "LDHU", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            default:
                    iprintld(out, "LDHU **unknown mode**", 0, 0, 0, "D", 0, 0);
                    break;

            }
            break;

	case 0x06 :
            /*LDW Load Byte*/
            switch (m_mode) {
            case 0x5:
                    iprintld(out, "LDW", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0x4:
                    iprintld(out, "LDW", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xd:
                    iprintld(out, "LDW", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xc:
                    iprintld(out, "LDW", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xf:
                    iprintld(out, "LDW", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xe:
                    iprintld(out, "LDW", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0x1:
                    iprintldc(out, "LDW", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0x0:
                    iprintldc(out, "LDW", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0x9:
                    iprintldc(out, "LDW", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0x8:
                    iprintldc(out, "LDW", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xb:
                    iprintldc(out, "LDW", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xa:
                    iprintldc(out, "LDW", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            default:
                    iprintld(out, "LDW **unknown mode**", 0, 0, 0, "D", 0, 0);
                    break;
            }
            break;

	case 0x03 :
            /*STB Store Byte*/
            switch (m_mode) {
            case 0x5:
                    iprintst(out, "STB", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0x4:
                    iprintst(out, "STB", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xd:
                    iprintst(out, "STB", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xc:
                    iprintst(out, "STB", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xf:
                    iprintst(out, "STB", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xe:
                    iprintst(out, "STB", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0x1:
                    iprintstc(out, "STB", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0x0:
                    iprintstc(out, "STB", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0x9:
                    iprintstc(out, "STB", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0x8:
                    iprintstc(out, "STB", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xb:
                    iprintstc(out, "STB", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xa:
                    iprintstc(out, "STB", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            default:
                    iprintst(out, "STB **unknown mode**", 0, 0, 0, "D", 0, 0);
                    break;
            }
            break;

	case 0x05 :
            /*STH Store Byte*/
            switch (m_mode) {
            case 0x5:
                    iprintst(out, "STH", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0x4:
                    iprintst(out, "STH", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xd:
                    iprintst(out, "STH", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xc:
                    iprintst(out, "STH", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xf:
                    iprintst(out, "STH", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

