hamayun/NaSiK/sw/llvm/tools/tmsc6x-dis/tms320C6x_instruction.cpp
            case 0xe:
                    iprintst(out, "STH", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0x1:
                    iprintstc(out, "STH", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0x0:
                    iprintstc(out, "STH", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0x9:
                    iprintstc(out, "STH", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0x8:
                    iprintstc(out, "STH", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xb:
                    iprintstc(out, "STH", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xa:
                    iprintstc(out, "STH", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            default:
                    iprintst(out, "STH **unknown mode**", 0, 0, 0, "D", 0, 0);
                    break;
            }
            break;

	case 0x07 :
            /*STW Store Byte*/
            switch (m_mode) {
            case 0x5:
                    iprintst(out, "STW", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0x4:
                    iprintst(out, "STW", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xd:
                    iprintst(out, "STW", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xc:
                    iprintst(out, "STW", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xf:
                    iprintst(out, "STW", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xe:
                    iprintst(out, "STW", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0x1:
                    iprintstc(out, "STW", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0x0:
                    iprintstc(out, "STW", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0x9:
                    iprintstc(out, "STW", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0x8:
                    iprintstc(out, "STW", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xb:
                    iprintstc(out, "STW", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            case 0xa:
                    iprintstc(out, "STW", m_src1, m_src2, m_dst, "D", m_s, m_y);
                    break;

            default:
                    iprintst(out, "STW **unknown mode**", 0, 0, 0, "D", 0, 0);
                    break;
            }
            break;

        default:
            DOUT << "Error: Unknown Instruction Type" << endl; 
            break;
    }
}

void tms320C6x_instruction :: print_dunit_ldstoffset(ostream *out)
{
    switch(m_op)
    {
	case 0x00 :
            /*LDHU Load HalfByte ucst15, m_dst; {+baseR[offset], dst} */
            iprintldc(out, "LDHU", m_uitmp, (m_y==0) ? 14 : 15, m_dst, "D", m_s, sideB);
            break;

	case 0x01 :
            /*LDBU Load Byte ucst15, m_dst; {+baseR[offset], dst} */
            iprintldc(out, "LDBU", m_uitmp, (m_y==0) ? 14 : 15, m_dst, "D", m_s, sideB);
            break;

	case 0x02 :
            /*LDB Load Byte ucst15, m_dst; {+baseR[offset], dst} */
            iprintldc(out, "LDB", m_uitmp, (m_y==0) ? 14 : 15, m_dst, "D", m_s, sideB);
            break;

	case 0x03 :
            /*STB Store Byte; {src, +baseR[offset]}*/
            iprintstc(out, "STB", m_uitmp, (m_y==0) ? 14 : 15, m_dst, "D", m_s, sideB);
            break;

	case 0x04 :
            /*LDH Load HlafByte ucst15, m_dst; {+baseR[offset], dst}*/
            iprintldc(out, "LDH", m_uitmp, (m_y==0) ? 14 : 15, m_dst, "D", m_s, sideB);
            break;

	case 0x05 :
            /*STH Store Halfword; {src, +baseR[offset]}*/
            iprintstc(out, "STH", m_uitmp, (m_y==0) ? 14 : 15, m_dst, "D", m_s, sideB);
            break;

	case 0x06 :
            /*LDW Load Word ucst15, m_dst; {+baseR[offset], dst}*/
            iprintldc_offset(out, "LDW", m_uitmp, (m_y==0) ? 14 : 15, m_dst, "D", m_s, sideB);
            break;

	case 0x07 :
            /*STW Store Word; {src, +baseR[offset]}*/
            iprintstc_offset(out, "STW", m_uitmp, (m_y==0) ? 14 : 15, m_dst, "D", m_s, sideB);
            break;

        default:
            DOUT << "Error: Unknown Instruction Type" << endl;
            break;
    }
}

void tms320C6x_instruction :: print_sunit_addk(ostream *out)
{
    switch(m_op)
    {
	case 0x00 :
            /*ADDK cst16, usint*/
            iprint2c(out, "ADDK", m_addk_const & 0x0000FFFF, m_dst, "S", m_s, m_x, 0);
            break;

        default:
            DOUT << "Error: Unknown Instruction Type" << endl;
            break;
    }

}

void tms320C6x_instruction :: print_sunit_immed(ostream *out)
{
    switch(m_op)
    {
	case 0x00 :
            /*EXTU Extract & Zero Extend a bit field*/
            /*ucst5, ucst5, usint, usint*/
            iprint4(out, "EXTU", m_immed_const1,
                   m_immed_const2, m_src2, m_dst, "S", m_s, m_x, 0);
            break;

	case 0x01 :
            /*EXT Extract & Sign Extend a bit field*/
            /*ucst5, ucst5, sint, sint*/
            iprint4(out, "EXT", m_immed_const1,
                   m_immed_const2, m_src2, m_dst, "S", m_s, m_x, 0);
            break;

        case 0x02 :
            /*SET Set Bit Fields of m_src2 whose bounds are given by csta & cstb*/
            /*ucst5, ucst5, usint, usint*/
            iprint4(out, "SET", m_immed_const1,
                   m_immed_const2, m_src2, m_dst, "S", m_s, m_x, 0);
            break;

	case 0x03 :
            /*CLR Clear Bit Fields of m_src2 whose bounds are given by csta & cstb*/
            /*ucst5, ucst5, usint, usint*/
            iprint4(out, "CLR", m_immed_const1,
                   m_immed_const2, m_src2, m_dst, "S", m_s, m_x, 0);
            break;

        default:
            DOUT << "Error: Unknown Instruction Type" << endl;
            break;
    }
}

void tms320C6x_instruction :: print_sunit_mvk(ostream *out)
{
    switch(m_op)
    {
        case 0x00:
            if(m_mvk_type == 0x00){
		/*MVK Move a 16bit signed constant into a Register & Sign Extend scst16, sint*/
		iprint2c(out, "MVK", m_mvk_sign_const, m_dst, "S", m_s, m_x, 0);
            }
            else if (m_mvk_type == 0x01){
		/*MVKH Move 16bit constant into the Upper Bits of a Register uscst16, sint*/
		iprint2c(out, "MVKH", m_mvk_unsign_const, m_dst, "S", m_s, m_x, 0);
            }
            break;

        default:
            DOUT << "Error: Unknown Instruction Type" << endl;
            break;
    }
}

void tms320C6x_instruction :: print_sunit_bcond(ostream *out)
{
    switch(m_op)
    {
        case 0x00:
            /*Branch Using a Displacement; {scst21}*/
            iprint1c(out, "B", m_bcond_disp, "S", m_s, m_x, 0);
            break;
            
        default:
            DOUT << "Error: Unknown Instruction Type" << endl;
            break;
    }
}

void tms320C6x_instruction :: print_idle(ostream *out)
{
    if(m_op == 0x78)
        iprint0(out, "IDLE");
    else if(m_op == 0x00)
        iprint01(out, "NOP", (uint32_t)m_nop_cnt);
    else
        DOUT << "Error: Unknown Instruction Type" << endl; 
}

void tms320C6x_instruction :: iprint(ostream *out, const char *inst, int32_t m_src1, int32_t m_src2,
		int32_t m_dst, const char *unit, uint8_t m_s, char m_x, char src1or2, char optype)
{
	char ab[3] = "AB";

        if((strcmp(inst, "SUB") == 0) && (m_src1 == m_src2) && !m_x){
            (*out) << "ZERO" << "." << unit << m_s+1 << (m_x?"X":"") <<"\t\t";
            if(optype & 0x1){
                (*out) << ab[m_s] << m_dst+1 << ":";
            }
            (*out) << ab[m_s] << m_dst;
        }
        else
        {
            (*out) << inst << "." << unit << m_s+1 << (m_x?"X":"") <<"\t\t";

            if(optype & 0x4){
                (*out) << ((m_x==1 && src1or2==1) ? ab[!m_s] : ab[m_s]) << m_src1+1 << ":";
            }

