hamayun/NaSiK/sw/llvm/tools/tmsc6x-dis/tms320C6x_instruction.cpp
            (*out) << ((m_x==1 && src1or2==1) ? ab[!m_s] : ab[m_s]) << m_src1 << ",";

            if(optype & 0x2){
                (*out) << ((m_x==1 && src1or2==2) ? ab[!m_s] : ab[m_s]) << m_src2+1 << ":";
            }

            (*out) << ((m_x==1 && src1or2==2) ? ab[!m_s] : ab[m_s]) << m_src2 << ",";

            if(optype & 0x1){
                (*out) << ab[m_s] << m_dst+1 << ":";
            }

            (*out) << ab[m_s] << m_dst;
        }
}

void tms320C6x_instruction :: iprint_shift(ostream *out, const char *inst, int32_t m_src1, int32_t m_src2,
		int32_t m_dst, const char *unit, uint8_t m_s, char m_x, char src1or2, char optype)
{
	char ab[3] = "AB";

        (*out) << inst << "." << unit << m_s+1 << (m_x?"X":"") <<"\t\t";

        if(optype & 0x2){
            (*out) << ((m_x==1 && src1or2==2) ? ab[!m_s] : ab[m_s]) << m_src2+1 << ":";
        }
        (*out) << ((m_x==1 && src1or2==2) ? ab[!m_s] : ab[m_s]) << m_src2 << ",";

        if(optype & 0x4){
            (*out) << ((m_x==1 && src1or2==1) ? ab[!m_s] : ab[m_s]) << m_src1+1 << ":";
        }
        (*out) << ((m_x==1 && src1or2==1) ? ab[!m_s] : ab[m_s]) << m_src1 << ",";

        if(optype & 0x1){
            (*out) << ab[m_s] << m_dst+1 << ":";
        }
        (*out) << ab[m_s] << m_dst;
}

void tms320C6x_instruction :: iprintc1(ostream *out, const char *inst, int32_t m_src1, int32_t m_src2,
		int32_t m_dst, const char *unit, uint8_t m_s, char m_x, char src1or2, char optype)
{
	char ab[3] = "AB";

        if((strcmp(inst, "ADD") == 0) && m_src1 == 0)
        {
            (*out) << "MV" << "." << unit << m_s+1 << (m_x?"X":"") << "\t\t";
            
            if(optype & 0x2)
                (*out) << ((m_x==1 && src1or2==2) ? ab[!m_s] : ab[m_s]) << m_src2+1 << ":";
            (*out) << ((m_x==1 && src1or2==2) ? ab[!m_s] : ab[m_s]) << m_src2 << ",";

            if(optype & 0x1)
                (*out) << ab[m_s] << m_dst+1 << ":";
            (*out) << ab[m_s] << m_dst;
        }
        else if((strcmp(inst, "ADD") == 0) && ((m_src1 >> 8) & 0xFFFFFF))
        {
            (*out) << "SUB" << "." << unit << m_s+1 << (m_x?"X":"") << "\t\t";

            if(optype & 0x2)
                (*out) << ((m_x==1 && src1or2==2) ? ab[!m_s] : ab[m_s]) << m_src2+1 << ":";
            (*out) << ((m_x==1 && src1or2==2) ? ab[!m_s] : ab[m_s]) << m_src2 << ",";

            (*out) << hex << "0x" << (-m_src1) << dec << ",";

            if(optype & 0x1)
                (*out) << ab[m_s] << m_dst+1 << ":";
            (*out) << ab[m_s] << m_dst;
        }
        else if ((strcmp(inst, "CMPLTU") == 0))
        {
            (*out) << inst << "." << unit << m_s+1 << (m_x?"X":"") << "\t\t"
                   << hex << "0x" << m_src1 << dec << ",";

            if(optype & 0x2)
                (*out) << ((m_x==1 && src1or2==2) ? ab[!m_s] : ab[m_s]) << m_src2+1 << ":";
            (*out) << ((m_x==1 && src1or2==2) ? ab[!m_s] : ab[m_s]) << m_src2 << ",";

            if(optype & 0x1)
                (*out) << ab[m_s] << m_dst+1 << ":";
            (*out) << ab[m_s] << m_dst;
        }
        else if((strcmp(inst, "SUB") == 0) && (m_src1 == 0))
        {
            (*out) << "NEG" << "." << unit << m_s+1 << (m_x?"X":"") << "\t\t";

            if(optype & 0x2)
                (*out) << ((m_x==1 && src1or2==2) ? ab[!m_s] : ab[m_s]) << m_src2+1 << ":";
            (*out) << ((m_x==1 && src1or2==2) ? ab[!m_s] : ab[m_s]) << m_src2 << ",";

            if(optype & 0x1)
                (*out) << ab[m_s] << m_dst+1 << ":";
            (*out) << ab[m_s] << m_dst;
        }
        else if((strcmp(inst, "XOR") == 0) && (m_src1 == -1))
        {
            (*out) << "NOT" << "." << unit << m_s+1 << (m_x?"X":"") << "\t\t";

            if(optype & 0x2)
                (*out) << ((m_x==1 && src1or2==2) ? ab[!m_s] : ab[m_s]) << m_src2+1 << ":";
            (*out) << ((m_x==1 && src1or2==2) ? ab[!m_s] : ab[m_s]) << m_src2 << ",";

            if(optype & 0x1)
                (*out) << ab[m_s] << m_dst+1 << ":";
            (*out) << ab[m_s] << m_dst;
        }
        else
        {
            (*out) << inst << "." << unit << m_s+1 << (m_x?"X":"") << "\t\t"; 

            (*out) << dec << m_src1 << ",";

            if(optype & 0x2)
                (*out) << ((m_x==1 && src1or2==2) ? ab[!m_s] : ab[m_s]) << m_src2+1 << ":";
            (*out) << ((m_x==1 && src1or2==2) ? ab[!m_s] : ab[m_s]) << m_src2 << ",";

            if(optype & 0x1)
                (*out) << ab[m_s] << m_dst+1 << ":";
            (*out) << ab[m_s] << m_dst;
        }
}

void tms320C6x_instruction :: iprintc1_shift(ostream *out, const char *inst, int32_t m_src1, int32_t m_src2,
		int32_t m_dst, const char *unit, uint8_t m_s, char m_x, char src1or2, char optype)
{
	char ab[3] = "AB";

        (*out) << inst << "." << unit << m_s+1 << (m_x?"X":"") << "\t\t";

        if(optype & 0x2){
            (*out) << ((m_x==1 && src1or2==2) ? ab[!m_s] : ab[m_s]) << m_src2+1 << ":";
        }
        (*out) << ((m_x==1 && src1or2==2) ? ab[!m_s] : ab[m_s]) << m_src2 << ",";
        
        (*out) << hex << "0x" << m_src1 << dec << ",";

        if(optype & 0x1){
            (*out) << ab[m_s] << m_dst+1 << ":";
        }
        (*out) << ab[m_s] << m_dst;
}

void tms320C6x_instruction :: iprintc2(ostream *out, const char *inst, int32_t m_src1, int32_t m_src2,
		int32_t m_dst, const char *unit, uint8_t m_s, char m_x, char src1or2)
{
	char ab[3] = "AB";

	(*out) << inst << "." << unit << m_s+1 << (m_x?"X":"") << "\t\t"
               << ((m_x==1 && src1or2==1) ? ab[!m_s] : ab[m_s])
               << m_src1 << ", " << m_src2 << ", " << ab[m_s] << m_dst;
}

void tms320C6x_instruction :: iprintld(ostream *out, const char *inst, int32_t m_src1, int32_t m_src2,
		int32_t m_dst, const char *unit, uint8_t m_s, uint8_t m_x)
{

	char ab[3] = "AB";

        (*out) << inst << "." << unit << m_x+1 << "T" << m_s+1 << "\t\t";

        switch (m_mode){
            case 0x5:
                    /* {+baseR[offsetR], dst} */
                    (*out) << "*+" << ab[m_x] << m_src2 << "[" << ab[m_x] << m_src1 << "]";
                    break;

            case 0x4:
                    /* {-baseR[offsetR], dst} */
                    (*out) << "*-" << ab[m_x] << m_src2 << "[" << ab[m_x] << m_src1 << "]";
                    break;

            case 0xd:
                    /* {++baseR[offsetR], dst} */
                    (*out) << "*++" << ab[m_x] << m_src2 << "[" << ab[m_x] << m_src1 << "]";
                    break;

            case 0xc:
                    /* {--baseR[offsetR], dst} */
                    (*out) << "*--" << ab[m_x] << m_src2 << "[" << ab[m_x] << m_src1 << "]";
                    break;

            case 0xf:
                    /* {baseR++[offsetR], dst} */
                    (*out) << "*" << ab[m_x] << m_src2 << "++" << "[" << ab[m_x] << m_src1 << "]";
                    break;

