hamayun/NaSiK/sw/llvm/tools/tmsc6x-dis/tms320C6x_instruction.cpp
            case 0xe:
                    /* {baseR--[offsetR], dst} */
                    (*out) << "*" << ab[m_x] << m_src2 << "--" << "[" << ab[m_x] << m_src1 << "]";
                    break;
        }

        (*out) << ","<< ab[m_s] << m_dst;
}

void tms320C6x_instruction :: iprint_rev(ostream *out, const char *inst, int32_t m_src1, int32_t m_src2,
		int32_t m_dst, const char *unit, uint8_t m_s, uint8_t m_x)
{
	char ab[3] = "AB";

        if((strcmp(inst, "SUB") == 0) && (m_src1 == m_src2)){
            (*out) << "ZERO" << "." << unit << m_s+1 << "\t\t"
                   << ab[m_s] << m_dst;
        }
        else
        {
            (*out) << inst << "." << unit << m_s+1 << "\t\t"
                   << ab[m_s] << m_src2 << ","
                   << ab[m_s] << m_src1 << ","
                   << ab[m_s] << m_dst;
        }
}

void tms320C6x_instruction :: iprint_revc(ostream *out, const char *inst, int32_t m_src1, int32_t m_src2,
		int32_t m_dst, const char *unit, uint8_t m_s, uint8_t m_x)
{
	char ab[3] = "AB";

        if((strcmp(inst, "ADD") == 0) && m_src1 == 0)
        {
            (*out) << "MV" << "." << unit << m_s+1 << "\t\t"
                   << ab[m_s] << m_src2 << ","
                   << ab[m_s] << m_dst;
        }
        else
        {
            (*out) << inst << "." << unit << m_s+1 << "\t\t"
                   << ab[m_s] << m_src2 << ","
                   << hex << "0x" << m_src1 << dec << ","
                   << ab[m_s] << m_dst;
        }
}

void tms320C6x_instruction :: iprintldc(ostream *out, const char *inst, int32_t m_src1, int32_t m_src2,
		int32_t m_dst, const char *unit, uint8_t m_s, uint8_t m_x)
{

	char ab[3] = "AB";

        (*out) << inst << "." << unit << m_x+1 << "T" << m_s+1 << "\t\t";

        switch (m_mode){
            case 0x1:
                    /* {+baseR[offset], dst} */
                    (*out) << "*+" << ab[m_x] << m_src2 << "[" << m_src1 << "]";
                    break;

            case 0x0:
                    /* {-baseR[offset], dst} */
                    (*out) << "*-" << ab[m_x] << m_src2 << "[" << m_src1 << "]";
                    break;

            case 0x9:
                    /* {++baseR[offset], dst} */
                    (*out) << "*++" << ab[m_x] << m_src2 << "[" << m_src1 << "]";
                    break;

            case 0x8:
                    /* {--baseR[offset], dst} */
                    (*out) << "*--" << ab[m_x] << m_src2 << "[" << m_src1 << "]";
                    break;

            case 0xb:
                    /* {baseR++[offset], dst} */
                    (*out) << "*" << ab[m_x] << m_src2 << "++" << "[" << m_src1 << "]";
                    break;

            case 0xa:
                    /* {baseR--[offset], dst} */
                    (*out) << "*" << ab[m_x] << m_src2 << "--" << "[" << m_src1 << "]";
                    break;
        }
        
        (*out) << "," << ab[m_s] << m_dst;
}

void tms320C6x_instruction :: iprintldc_offset(ostream *out, const char *inst, int32_t m_src1, int32_t m_src2,
		int32_t m_dst, const char *unit, uint8_t m_s, uint8_t m_x)
{

	char ab[3] = "AB";

        (*out) << inst << "." << unit << m_x+1 << "T" << m_s+1 << "\t\t"
               << "*+" << ab[m_x] << m_src2 << "[" << m_src1 << "]"
               << "," << ab[m_s] << m_dst;
}

void tms320C6x_instruction :: iprintst(ostream *out, const char *inst, int32_t m_src1, int32_t m_src2,
		int32_t m_dst, const char *unit, uint8_t m_s, uint8_t m_x)
{
	char ab[3] = "AB";

        (*out) << inst << "." << unit << m_x+1 << "T" << m_s+1 << "\t\t"
               << ab[m_s] << m_dst << ",*";

        switch (m_mode){
            case 0x5:
                    /* {+baseR[offsetR], dst} */
                    (*out) << "+" << ab[m_x] << m_src2 << "[" << ab[m_x] << m_src1 << "]";
                    break;

            case 0x4:
                    /* {-baseR[offsetR], dst} */
                    (*out) << "-" << ab[m_x] << m_src2 << "[" << ab[m_x] << m_src1 << "]";
                    break;

            case 0xd:
                    /* {++baseR[offsetR], dst} */
                    (*out) << "++" << ab[m_x] << m_src2 << "[" << ab[m_x] << m_src1 << "]";
                    break;

            case 0xc:
                    /* {--baseR[offsetR], dst} */
                    (*out) << "--" << ab[m_x] << m_src2 << "[" << ab[m_x] << m_src1 << "]";
                    break;

            case 0xf:
                    /* {baseR++[offsetR], dst} */
                    (*out) << ab[m_x] << m_src2 << "++" << "[" << ab[m_x] << m_src1 << "]";
                    break;

            case 0xe:
                    /* {baseR--[offsetR], dst} */
                    (*out) << ab[m_x] << m_src2 << "--" << "[" << ab[m_x] << m_src1 << "]";
                    break;
        }
}

void tms320C6x_instruction :: iprintstc(ostream *out, const char *inst, int32_t m_src1, int32_t m_src2,
		int32_t m_dst, const char *unit, uint8_t m_s, uint8_t m_x)
{
	char ab[3] = "AB";

        (*out) << inst << "." << unit << m_x+1 << "T" << m_s+1 << "\t\t"
               << ab[m_s] << m_dst << ",*"; 
        
        switch (m_mode){
            case 0x1:
                    /* {+baseR[offset], dst} */
                    (*out) << "+" << ab[m_x] << m_src2 << "[" << m_src1 << "]";
                    break;

            case 0x0:
                    /* {-baseR[offset], dst} */
                    (*out) << "-" << ab[m_x] << m_src2 << "[" << m_src1 << "]";
                    break;

            case 0x9:
                    /* {++baseR[offset], dst} */
                    (*out) << "++" << ab[m_x] << m_src2 << "[" << m_src1 << "]";
                    break;

            case 0x8:
                    /* {--baseR[offset], dst} */
                    (*out) << "--" << ab[m_x] << m_src2 << "[" << m_src1 << "]";
                    break;

            case 0xb:
                    /* {baseR++[offset], dst} */
                    (*out) << ab[m_x] << m_src2 << "++" << "[" << m_src1 << "]";
                    break;

