hamayun/NaSiK/sw/llvm/tools/tmsc6x-dis/tms320C6x_instruction.cpp
            case 0xa:
                    /* {baseR--[offset], dst} */
                    (*out) << ab[m_x] << m_src2 << "--" << "[" << m_src1 << "]";
                    break;
        }
}

void tms320C6x_instruction :: iprintstc_offset(ostream *out, const char *inst, int32_t m_src1, int32_t m_src2,
		int32_t m_dst, const char *unit, uint8_t m_s, uint8_t m_x)
{
	char ab[3] = "AB";

        (*out) << inst << "." << unit << m_x+1 << "T" << m_s+1 << "\t\t"
               << ab[m_s] << m_dst << ",*"
               << "+" << ab[m_x] << m_src2 << "[" << m_src1 << "]";
}

void tms320C6x_instruction :: iprint4(ostream *out, const char *inst, int32_t csta, int32_t cstb,
		int32_t m_src2, int32_t m_dst, const char *unit, uint8_t m_s, char m_x,
		char src1or2)
{
	char ab[3] = "AB";

	(*out) << inst << "." << unit << m_s+1 << (m_x?"X":"") << "\t\t"
               << ((m_x==1 && src1or2==2) ? ab[!m_s] : ab[m_s]) << m_src2 << ","
               << csta << "," << cstb << ","
               << ab[m_s] << m_dst;
}

void tms320C6x_instruction :: iprint2(ostream *out, const char *inst, int32_t m_src2, int32_t m_dst,
		const char *unit, uint8_t m_s, char m_x, char src1or2, char optype) {
	char ab[3] = "AB";

	(*out) << inst << "." << unit << m_s+1 << (m_x?"X":"") << "\t\t";
        if(optype & 0x2){
            (*out) << ((m_x==1 && src1or2==2) ? ab[!m_s] : ab[m_s]) << m_src2+1 << ":";
        }
        (*out) << ((m_x==1 && src1or2==2) ? ab[!m_s] : ab[m_s]) << m_src2 << ",";

        if(optype & 0x1){
            (*out) << ab[m_s] << m_dst+1 << ":";
        }
        (*out) << ab[m_s] << m_dst;
}

void tms320C6x_instruction :: iprint2mvc(ostream *out, const char *inst, int32_t m_src2, int32_t m_dst,
		const char *unit, uint8_t m_s, char m_x, char src1or2) {
	char ab[3] = "AB";
        char ctrl_reg[8][5] = {"AMR", "CSR", "ISR", "ICR", "IER", "ISTP", "IRP", "NRP"};
        //PCE1   = 16 GFPGFR = 24       // Ignored for the moment

        if(src1or2 == 0)
        {
            (*out) << inst << "." << unit << m_s+1 << (m_x?"X":"") << "\t\t"
                   << ctrl_reg[m_src2] << ","
                   << ab[m_s] << m_dst;
        }
        else if(src1or2 == 2)
        {
            (*out) << inst << "." << unit << m_s+1 << (m_x?"X":"") << "\t\t"
                   << ab[m_s] << m_src2 << ","
                   << ctrl_reg[m_dst];
        }
}

void tms320C6x_instruction :: iprint2c(ostream *out, const char *inst, int32_t m_src2, int32_t m_dst,
		const char *unit, uint8_t m_s, char m_x, char src1or2)
{
	char ab[3] = "AB";

        if(strcmp("MVK", inst) == 0 || strcmp("MVKH", inst) == 0)
        {
            (*out) << inst << "." << unit << m_s+1 << (m_x?"X":"") << "\t\t";

            if((m_src2 >> 16) == 0x0000 && ((m_src2 >> 12) & 0x8))
                (*out) << FMT_INT << ((m_src2 << 16) >> 16) << dec << "," << ab[m_s] << m_dst;
            else
                (*out) << FMT_SHORT << m_src2 << dec << "," << ab[m_s] << m_dst;
        }
        else
        {
            int16_t signed_src2 = m_src2;

            (*out) << inst << "." << unit << m_s+1 << (m_x?"X":"") << "\t\t"
                   << signed_src2 << dec << "," << ab[m_s] << m_dst;
        }
}

void tms320C6x_instruction :: iprint_breg(ostream *out, const char *inst, int32_t m_dst, const char *unit,
		uint8_t m_s, char m_x, char src1or2)
{
	char ab[3] = "AB";

	(*out) << inst << "." << unit << m_s+1 << (m_x?"X":"") << "\t\t"
               << (m_x ? ab[!m_s] : ab[m_s]) << m_dst; 
}

void tms320C6x_instruction :: iprint1c(ostream *out, const char *inst, int32_t bcond_disp, const char *unit,
		char m_s, char m_x, char src1or2)
{
    fetch_packet      * p_fetpkt       = get_parent()->get_parent();
    if(p_fetpkt == NULL)
    {
        cout << "Fetch Packet Parent NULL";
        return;
    }
    coff_symbol_table * p_symtab       = p_fetpkt->get_parent()->get_symbol_table();
    coff_symtab_entry * p_symtab_entry = p_symtab->get_symtab_entry_byval(bcond_disp);
    char * ptr_str = NULL; 

    if(p_symtab_entry)
    {
        ptr_str = p_symtab_entry->get_name_str();

        if(memcmp(ptr_str, ".text:", 6) == 0){
            ptr_str += 6;
        }

        if(p_symtab->is_hidden_label(ptr_str)){
            ptr_str = NULL;
        }
    }

    if(ptr_str)
    {
        int    cur_pc       = p_fetpkt->get_fetch_pkt_address();
        int    cur_offset   = bcond_disp - cur_pc;
        
        (*out) << inst << "." << unit << m_s+1 << "\t\t"
               << ptr_str << " (PC" << (cur_offset >= 0 ? "+" :"") << dec << cur_offset
               << " = 0x" << hex << setw(8) << bcond_disp << dec << ")";
    }
    else
    {
        (*out) << inst << "." << unit << m_s+1 << "\t\t"
               << "0x" << hex << setw(6) << bcond_disp << dec;
    }
}

void tms320C6x_instruction :: iprint0(ostream *out, const char *inst)
{
	(*out) << inst;
}

void tms320C6x_instruction :: iprint01(ostream *out, const char *inst, uint32_t num)
{
    if(num > 1)
	(*out) << inst << "\t\t" << num;
    else
        (*out) << inst;
}
